# StationingSurveyFeet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..StationingSurveyFeet Property
UnitTypeId Class See Also
---
US survey feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId StationingSurveyFeet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StationingSurveyFeet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StationingSurveyFeet {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace